Catalogs/СотрудникиАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СотрудникиАутсорсинг</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСотрудников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСотрудниковАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прикреплен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мобильный</Name>
					<Comment>Дополнительный признак, для удобства построения графиков внештатными менеджерами</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПерсоналККМ</Name>
					<Comment>Код, соответствующий коду справочника Персонал ККМ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЖурналУчетаСотрудниковПоДнямАутсорсинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналУчетаСотрудниковПоДнямАутсорсинг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтраженияПриходаУходаПродавцов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоМагазину</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденоМагазином</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденоПомощником</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодтвержденоОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаявкаНаУслуги</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслугиМатериалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>idЗаписиПриход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idЗаписиУход</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПерсоналККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помощник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиАутсорсинг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СотрудникиАутсорсинг/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Информация

//+++АК mika 2018.03.16 Рефакторинг кода формы 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++АК mika 2018.01.19 В рамках приведения подсистемы в рабочее состояние.
	РольПолныеПрава = РольДоступна("ПолныеПрава");	
	//+++АК mika
	
	Если НЕ РольПолныеПрава И Объект.Ссылка.Пустая() Тогда
		ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
		Если ТекПользователь.ГруппаСотрудниковАутсорсинг.Пустая() Тогда
			Сообщить("Для текущего пользователя не указана группа сотрудников (аутсорсинг)!");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Объект.ГруппаСотрудников = ТекПользователь.ГруппаСотрудниковАутсорсинг;
	КонецЕсли;
	
	РазложитьФИОНаФамилиюИмяОтчество(Объект.Наименование);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НадоЗаполнять = Справочники.СотрудникиАутсорсинг.НадоЗаполнятьОтветственногоМенеджера(Объект.Должность);
	Если НадоЗаполнять
			И Объект.ОтветственныйМенеджер.Пустая() Тогда
		Сообщить("Не указан ответственный менеджер! Запись невозможна.");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	РазложитьФИОНаФамилиюИмяОтчество(Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	
	ПредлагаемНаименование = СокрЛП(ЭтаФорма.Фамилия) + " " + СокрЛП(ЭтаФорма.Имя) + " " + СокрЛП(ЭтаФорма.Отчество);
	Если НЕ Объект.Наименование = ПредлагаемНаименование Тогда
		Объект.Наименование = ПредлагаемНаименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	
	ПредлагаемНаименование = СокрЛП(ЭтаФорма.Фамилия) + " " + СокрЛП(ЭтаФорма.Имя) + " " + СокрЛП(ЭтаФорма.Отчество);
	Если НЕ Объект.Наименование = ПредлагаемНаименование Тогда
		Объект.Наименование = ПредлагаемНаименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	
	ПредлагаемНаименование = СокрЛП(ЭтаФорма.Фамилия) + " " + СокрЛП(ЭтаФорма.Имя) + " " + СокрЛП(ЭтаФорма.Отчество);
	Если НЕ Объект.Наименование = ПредлагаемНаименование Тогда
		Объект.Наименование = ПредлагаемНаименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = ПолучитьФорму("Справочник.ДолжностиВнештатныхСотрудников.Форма.ФормаВыбора",, Элемент);
	
	ФормаВыбора.Элементы.Список.ТекущаяСтрока = Объект.Должность;

	ФормаВыбора.ТолькоПросмотр = Истина;
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Функция ПечатьБейджаНаСервере()
	
	МассивСотрудников = Новый Массив;
	МассивСотрудников.Добавить(Объект.Ссылка);
	
	Возврат Справочники.СотрудникиАутсорсинг.ПечатьБейджейНаСервере(МассивСотрудников);
	
КонецФункции

&НаКлиенте
Процедура ПечатьБейджа(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Печать бейджа возможна только после записи!");
		Возврат;
	КонецЕсли;
	
	//+++АК mika 2018.01.22 ИП-00017263.02
	ОткрытьФорму("Обработка.ПечатьБейджейПродавцов.Форма.Форма", Новый Структура("ГруппаСотрудников", Объект.ГруппаСотрудников), , "ТД_ПечатьБейджей");
	Возврат;
	//---АК mika
	
	//
	ТабДок = ПечатьБейджаНаСервере();
	
	ОткрытьФорму("ОбщаяФорма.ФормаОтображенияТабДокумента", Новый Структура("ТабДок, УстановитьЗаголовок", ТабДок, "Бэйдж"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДолжностьЖурналУчета(Команда) //+++АК mika 2018.02.16 ИП-00017263.04
	
	Оповещение = Новый ОписаниеОповещения("ОбновитьДолжностьЖурналУчетаВопросЗавершение", ЭтаФорма);
	
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Обновить должность в журнале учета?'", "ru"), РежимДиалогаВопрос.ДаНет, 15 );
	
КонецПроцедуры

&НаКлиенте
Процедура КодПерсоналККМОткрытие(Элемент, СтандартнаяОбработка) //+++АК mika 2018.03.15 ИП-00017869
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.КодПерсоналККМ) Тогда
		ОткрытьЗначение(ПолучитьСсылкаПоКодуПерсоналККМ(Объект.КодПерсоналККМ));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОбновитьДолжностьЖурналУчетаВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт //+++АК mika 2018.02.16 ИП-00017263.04
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Диалог = Новый ДиалогРедактированияСтандартногоПериода();
		СтандартныйПериод = Новый СтандартныйПериод();
		
		СтандартныйПериод.ДатаНачала = НачалоМесяца(ТекущаяДата());
		СтандартныйПериод.ДатаОкончания = КонецМесяца(ТекущаяДата());
		
		Диалог.Период = СтандартныйПериод;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораПериода",ЭтаФорма);
		
		Диалог.Показать(ОписаниеОповещения)  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПериода(Результат, ДополнительныеПараметры) Экспорт //+++АК mika 2018.02.16 ИП-00017263.04
	
	Если Результат <> Неопределено Тогда
		
		СтруктураПараметров = Новый Структура();
		
		СтруктураПараметров.Вставить("НачалоПериода", Результат.ДатаНачала);
		СтруктураПараметров.Вставить("КонецПериода", Результат.ДатаОкончания);
		СтруктураПараметров.Вставить("Сотрудник", Объект.Ссылка);
		
		ОбновитьДолжностьСотрудникаЖурналУчетаСервер(СтруктураПараметров);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РазложитьФИОНаФамилиюИмяОтчество(ТекФИО)
	
	ТекущиеФИО = ТекФИО;
	ПозПробела = Найти(ТекущиеФИО, " ");
	Если ПозПробела > 0 Тогда
		ЭтаФорма.Фамилия = СокрЛП(Лев(ТекущиеФИО, ПозПробела - 1));
		ТекущиеФИО = Сред(ТекущиеФИО, ПозПробела + 1);
		ПозПробела = Найти(ТекущиеФИО, " ");
		Если ПозПробела > 0 Тогда
			ЭтаФорма.Имя 		= СокрЛП(Лев(ТекущиеФИО	, ПозПробела - 1));
			ЭтаФорма.Отчество 	= СокрЛП(Сред(ТекущиеФИО, ПозПробела + 1));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДолжностьСотрудникаЖурналУчетаСервер(СтруктураПараметров)  //+++АК mika 2018.02.16 ИП-00017263.04
	
	РегистрыСведений.ЖурналУчетаСотрудниковПоДнямАутсорсинг.ОбновитьДолжностьСотрудникаЖурналУчета(СтруктураПараметров);
		
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьСсылкаПоКодуПерсоналККМ(КодККМ) //+++АК mika 2018.03.15 ИП-00017869
	
	Возврат Справочники.ПерсоналККМ.НайтиПоКоду(КодККМ);
		
КонецФункции

#КонецОбласти
